{
    "class_name": "Functional",
    "config": {
        "name": "model_1",
        "layers": [
            {
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        64,
                        64,
                        3
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "input_4"
                },
                "name": "input_4",
                "inbound_nodes": []
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d_9",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 3,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "conv2d_9",
                "inbound_nodes": [
                    [
                        [
                            "input_4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Functional",
                "config": {
                    "name": "xception",
                    "layers": [
                        {
                            "class_name": "InputLayer",
                            "config": {
                                "batch_input_shape": [
                                    null,
                                    null,
                                    null,
                                    3
                                ],
                                "dtype": "float32",
                                "sparse": false,
                                "ragged": false,
                                "name": "input_3"
                            },
                            "name": "input_3",
                            "inbound_nodes": []
                        },
                        {
                            "class_name": "Conv2D",
                            "config": {
                                "name": "block1_conv1",
                                "trainable": true,
                                "dtype": "float32",
                                "filters": 32,
                                "kernel_size": [
                                    3,
                                    3
                                ],
                                "strides": [
                                    2,
                                    2
                                ],
                                "padding": "valid",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "groups": 1,
                                "activation": "linear",
                                "use_bias": false,
                                "kernel_initializer": {
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    }
                                },
                                "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            },
                            "name": "block1_conv1",
                            "inbound_nodes": [
                                [
                                    [
                                        "input_3",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "class_name": "BatchNormalization",
                            "config": {
                                "name": "block1_conv1_bn",
                                "trainable": true,
                                "dtype": "float32",
                                "axis": [
                                    3
                                ],
                                "momentum": 0.99,
                                "epsilon": 0.001,
                                "center": true,
                                "scale": true,
                                "beta_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "gamma_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                },
                                "moving_mean_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "moving_variance_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                },
                                "beta_regularizer": null,
                                "gamma_regularizer": null,
                                "beta_constraint": null,
                                "gamma_constraint": null
                            },
                            "name": "block1_conv1_bn",
                            "inbound_nodes": [
                                [
                                    [
                                        "block1_conv1",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "class_name": "Activation",
                            "config": {
                                "name": "block1_conv1_act",
                                "trainable": true,
                                "dtype": "float32",
                                "activation": "relu"
                            },
                            "name": "block1_conv1_act",
                            "inbound_nodes": [
                                [
                                    [
                                        "block1_conv1_bn",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "class_name": "Conv2D",
                            "config": {
                                "name": "block1_conv2",
                                "trainable": true,
                                "dtype": "float32",
                                "filters": 64,
                                "kernel_size": [
                                    3,
                                    3
                                ],
                                "strides": [
                                    1,
                                    1
                                ],
                                "padding": "valid",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "groups": 1,
                                "activation": "linear",
                                "use_bias": false,
                                "kernel_initializer": {
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    }
                                },
                                "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            },
                            "name": "block1_conv2",
                            "inbound_nodes": [
                                [
                                    [
                                        "block1_conv1_act",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "class_name": "BatchNormalization",
                            "config": {
                                "name": "block1_conv2_bn",
                                "trainable": true,
                                "dtype": "float32",
                                "axis": [
                                    3
                                ],
                                "momentum": 0.99,
                                "epsilon": 0.001,
                                "center": true,
                                "scale": true,
                                "beta_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "gamma_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                },
                                "moving_mean_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "moving_variance_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                },
                                "beta_regularizer": null,
                                "gamma_regularizer": null,
                                "beta_constraint": null,
                                "gamma_constraint": null
                            },
                            "name": "block1_conv2_bn",
                            "inbound_nodes": [
                                [
                                    [
                                        "block1_conv2",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "class_name": "Activation",
                            "config": {
                                "name": "block1_conv2_act",
                                "trainable": true,
                                "dtype": "float32",
                                "activation": "relu"
                            },
                            "name": "block1_conv2_act",
                            "inbound_nodes": [
                                [
                                    [
                                        "block1_conv2_bn",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "class_name": "SeparableConv2D",
                            "config": {
                                "name": "block2_sepconv1",
                                "trainable": true,
                                "dtype": "float32",
                                "filters": 128,
                                "kernel_size": [
                                    3,
                                    3
                                ],
                                "strides": [
                                    1,
                                    1
                                ],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "groups": 1,
                                "activation": "linear",
                                "use_bias": false,
                                "kernel_initializer": {
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    }
                                },
                                "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {},
                                    "shared_object_id": 25
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null,
                                "depth_multiplier": 1,
                                "depthwise_initializer": {
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    }
                                },
                                "pointwise_initializer": {
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    }
                                },
                                "depthwise_regularizer": null,
                                "pointwise_regularizer": null,
                                "depthwise_constraint": null,
                                "pointwise_constraint": null
                            },
                            "name": "block2_sepconv1",
                            "inbound_nodes": [
                                [
                                    [
                                        "block1_conv2_act",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "class_name": "BatchNormalization",
                            "config": {
                                "name": "block2_sepconv1_bn",
                                "trainable": true,
                                "dtype": "float32",
                                "axis": [
                                    3
                                ],
                                "momentum": 0.99,
                                "epsilon": 0.001,
                                "center": true,
                                "scale": true,
                                "beta_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "gamma_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                },
                                "moving_mean_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "moving_variance_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                },
                                "beta_regularizer": null,
                                "gamma_regularizer": null,
                                "beta_constraint": null,
                                "gamma_constraint": null
                            },
                            "name": "block2_sepconv1_bn",
                            "inbound_nodes": [
                                [
                                    [
                                        "block2_sepconv1",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "class_name": "Activation",
                            "config": {
                                "name": "block2_sepconv2_act",
                                "trainable": true,
                                "dtype": "float32",
                                "activation": "relu"
                            },
                            "name": "block2_sepconv2_act",
                            "inbound_nodes": [
                                [
                                    [
                                        "block2_sepconv1_bn",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "class_name": "SeparableConv2D",
                            "config": {
                                "name": "block2_sepconv2",
                                "trainable": true,
                                "dtype": "float32",
                                "filters": 128,
                                "kernel_size": [
                                    3,
                                    3
                                ],
                                "strides": [
                                    1,
                                    1
                                ],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "groups": 1,
                                "activation": "linear",
                                "use_bias": false,
                                "kernel_initializer": {
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    }
                                },
                                "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {},
                                    "shared_object_id": 36
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null,
                                "depth_multiplier": 1,
                                "depthwise_initializer": {
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    }
                                },
                                "pointwise_initializer": {
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    }
                                },
                                "depthwise_regularizer": null,
                                "pointwise_regularizer": null,
                                "depthwise_constraint": null,
                                "pointwise_constraint": null
                            },
                            "name": "block2_sepconv2",
                            "inbound_nodes": [
                                [
                                    [
                                        "block2_sepconv2_act",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "class_name": "BatchNormalization",
                            "config": {
                                "name": "block2_sepconv2_bn",
                                "trainable": true,
                                "dtype": "float32",
                                "axis": [
                                    3
                                ],
                                "momentum": 0.99,
                                "epsilon": 0.001,
                                "center": true,
                                "scale": true,
                                "beta_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "gamma_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                },
                                "moving_mean_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "moving_variance_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                },
                                "beta_regularizer": null,
                                "gamma_regularizer": null,
                                "beta_constraint": null,
                                "gamma_constraint": null
                            },
                            "name": "block2_sepconv2_bn",
                            "inbound_nodes": [
                                [
                                    [
                                        "block2_sepconv2",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "class_name": "Conv2D",
                            "config": {
                                "name": "conv2d_5",
                                "trainable": true,
                                "dtype": "float32",
                                "filters": 128,
                                "kernel_size": [
                                    1,
                                    1
                                ],
                                "strides": [
                                    2,
                                    2
                                ],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "groups": 1,
                                "activation": "linear",
                                "use_bias": false,
                                "kernel_initializer": {
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    }
                                },
                                "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            },
                            "name": "conv2d_5",
                            "inbound_nodes": [
                                [
                                    [
                                        "block1_conv2_act",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "class_name": "MaxPooling2D",
                            "config": {
                                "name": "block2_pool",
                                "trainable": true,
                                "dtype": "float32",
                                "pool_size": [
                                    3,
                                    3
                                ],
                                "padding": "same",
                                "strides": [
                                    2,
                                    2
                                ],
                                "data_format": "channels_last"
                            },
                            "name": "block2_pool",
                            "inbound_nodes": [
                                [
                                    [
                                        "block2_sepconv2_bn",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "class_name": "BatchNormalization",
                            "config": {
                                "name": "batch_normalization_6",
                                "trainable": true,
                                "dtype": "float32",
                                "axis": [
                                    3
                                ],
                                "momentum": 0.99,
                                "epsilon": 0.001,
                                "center": true,
                                "scale": true,
                                "beta_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "gamma_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                },
                                "moving_mean_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "moving_variance_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                },
                                "beta_regularizer": null,
                                "gamma_regularizer": null,
                                "beta_constraint": null,
                                "gamma_constraint": null
                            },
                            "name": "batch_normalization_6",
                            "inbound_nodes": [
                                [
                                    [
                                        "conv2d_5",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "class_name": "Add",
                            "config": {
                                "name": "add_12",
                                "trainable": true,
                                "dtype": "float32"
                            },
                            "name": "add_12",
                            "inbound_nodes": [
                                [
                                    [
                                        "block2_pool",
                                        0,
                                        0,
                                        {}
                                    ],
                                    [
                                        "batch_normalization_6",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "class_name": "Activation",
                            "config": {
                                "name": "block3_sepconv1_act",
                                "trainable": true,
                                "dtype": "float32",
                                "activation": "relu"
                            },
                            "name": "block3_sepconv1_act",
                            "inbound_nodes": [
                                [
                                    [
                                        "add_12",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "class_name": "SeparableConv2D",
                            "config": {
                                "name": "block3_sepconv1",
                                "trainable": true,
                                "dtype": "float32",
                                "filters": 256,
                                "kernel_size": [
                                    3,
                                    3
                                ],
                                "strides": [
                                    1,
                                    1
                                ],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "groups": 1,
                                "activation": "linear",
                                "use_bias": false,
                                "kernel_initializer": {
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    }
                                },
                                "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {},
                                    "shared_object_id": 57
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null,
                                "depth_multiplier": 1,
                                "depthwise_initializer": {
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    }
                                },
                                "pointwise_initializer": {
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    }
                                },
                                "depthwise_regularizer": null,
                                "pointwise_regularizer": null,
                                "depthwise_constraint": null,
                                "pointwise_constraint": null
                            },
                            "name": "block3_sepconv1",
                            "inbound_nodes": [
                                [
                                    [
                                        "block3_sepconv1_act",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "class_name": "BatchNormalization",
                            "config": {
                                "name": "block3_sepconv1_bn",
                                "trainable": true,
                                "dtype": "float32",
                                "axis": [
                                    3
                                ],
                                "momentum": 0.99,
                                "epsilon": 0.001,
                                "center": true,
                                "scale": true,
                                "beta_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "gamma_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                },
                                "moving_mean_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "moving_variance_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                },
                                "beta_regularizer": null,
                                "gamma_regularizer": null,
                                "beta_constraint": null,
                                "gamma_constraint": null
                            },
                            "name": "block3_sepconv1_bn",
                            "inbound_nodes": [
                                [
                                    [
                                        "block3_sepconv1",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "class_name": "Activation",
                            "config": {
                                "name": "block3_sepconv2_act",
                                "trainable": true,
                                "dtype": "float32",
                                "activation": "relu"
                            },
                            "name": "block3_sepconv2_act",
                            "inbound_nodes": [
                                [
                                    [
                                        "block3_sepconv1_bn",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "class_name": "SeparableConv2D",
                            "config": {
                                "name": "block3_sepconv2",
                                "trainable": true,
                                "dtype": "float32",
                                "filters": 256,
                                "kernel_size": [
                                    3,
                                    3
                                ],
                                "strides": [
                                    1,
                                    1
                                ],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "groups": 1,
                                "activation": "linear",
                                "use_bias": false,
                                "kernel_initializer": {
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    }
                                },
                                "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {},
                                    "shared_object_id": 68
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null,
                                "depth_multiplier": 1,
                                "depthwise_initializer": {
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    }
                                },
                                "pointwise_initializer": {
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    }
                                },
                                "depthwise_regularizer": null,
                                "pointwise_regularizer": null,
                                "depthwise_constraint": null,
                                "pointwise_constraint": null
                            },
                            "name": "block3_sepconv2",
                            "inbound_nodes": [
                                [
                                    [
                                        "block3_sepconv2_act",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "class_name": "BatchNormalization",
                            "config": {
                                "name": "block3_sepconv2_bn",
                                "trainable": true,
                                "dtype": "float32",
                                "axis": [
                                    3
                                ],
                                "momentum": 0.99,
                                "epsilon": 0.001,
                                "center": true,
                                "scale": true,
                                "beta_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "gamma_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                },
                                "moving_mean_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "moving_variance_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                },
                                "beta_regularizer": null,
                                "gamma_regularizer": null,
                                "beta_constraint": null,
                                "gamma_constraint": null
                            },
                            "name": "block3_sepconv2_bn",
                            "inbound_nodes": [
                                [
                                    [
                                        "block3_sepconv2",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "class_name": "Conv2D",
                            "config": {
                                "name": "conv2d_6",
                                "trainable": true,
                                "dtype": "float32",
                                "filters": 256,
                                "kernel_size": [
                                    1,
                                    1
                                ],
                                "strides": [
                                    2,
                                    2
                                ],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "groups": 1,
                                "activation": "linear",
                                "use_bias": false,
                                "kernel_initializer": {
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    }
                                },
                                "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            },
                            "name": "conv2d_6",
                            "inbound_nodes": [
                                [
                                    [
                                        "add_12",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "class_name": "MaxPooling2D",
                            "config": {
                                "name": "block3_pool",
                                "trainable": true,
                                "dtype": "float32",
                                "pool_size": [
                                    3,
                                    3
                                ],
                                "padding": "same",
                                "strides": [
                                    2,
                                    2
                                ],
                                "data_format": "channels_last"
                            },
                            "name": "block3_pool",
                            "inbound_nodes": [
                                [
                                    [
                                        "block3_sepconv2_bn",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "class_name": "BatchNormalization",
                            "config": {
                                "name": "batch_normalization_7",
                                "trainable": true,
                                "dtype": "float32",
                                "axis": [
                                    3
                                ],
                                "momentum": 0.99,
                                "epsilon": 0.001,
                                "center": true,
                                "scale": true,
                                "beta_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
